{
"posts": [{
  "title": "Anti-eviction Mapping Project And Carto Expose Realities Of Gentrification And Evictions In San Francisco",
  "imageFeature": "https://carto.com/blog/img/posts/2016/2016-07-20-anti-eviction-mapping/evictions-map.edbd682e.png",
  "imageContent":"https://carto.com/blog/img/posts/2016/2016-07-20-anti-eviction-mapping/evicting.9074b5e9.png" ,
  "teaser": "San Francisco has long been at the forefront of the discussion about the impact gentrification and the changing economic and demographic landscapes have on cities and the people who live there. CARTO has partnered with San Fransisco-based Anti-Eviction Mapping Project in order to analyze the data trends in rapid gentrification and the eviction of local populations.",
  "content": "Recently, this partnership produced an insightful map which was published in Fastco Design, demonstrating how a growing tech industry is leading to an increased demand for housing, resulting in an increase in evictions. Understanding causal relationships at play is crucial while advocating for policy that can protect the people who feel the intended and unintended consequences of a changing city. With this analysis, we used CARTO’s Data Observatory to augment the data provided to us by AEMP. The first steps we took were to take the locations of each eviction in 2015 and aggregate them into the census tracts that they fell within, making sure to sum over the number of evictions at specific locations. The Data Observatory was crucial here because it allowed us to easily get the census tract boundaries only for San Francisco. Aggregating points into the Census boundaries, we got the counts of evictions by census tract. Our next step was to give those counts more context by dividing by the number of households in each census tract from the American Community Survey. Using the CARTO Builder again, those values can be retrieved by adding an analysis step to enrich from the Data Observatory. Dividing our eviction counts by the number of households over 10,000 gives us a solid metric for comparing eviction rates in different census tracts: number of evictions per 10,000 households. Now that we have a solid metric for analysis, we can start adding additional factors to provide a richer context. One of our favorite datasets is of demographic segmentation produced by Spielman and Singleton. It is a great dataset for enrichment because it distills much of the complexity of the demographic variables down into human-readable descriptions of the underlying demographic information at different locations. Read more about demographic segments in Stuart’s blog post.",
  "timestamp": "moment.now()" ,
  "author": "CartoDB"

}, {
  "title": "Chartkick",
  "imageFeature": "http://i1-scripts.softpedia-static.com/screenshots/Chartkick-py_1.png",
  "imageContent":"http://geekhmer.github.io/images/chartkick.png" ,
  "teaser": "Create beautiful Javascript charts with one line of Ruby",
  "content": "Chartkick is a charting library for Ruby on Rails that allows you to easily create nice looking charts. Chartkick is compatible with all major browsers and can easily be used to give your Ruby on Rails application some additional flair",
  "timestamp": "moment.now()" ,
  "author": "Chartkick"

}, {
  "title": "ReactJS Audio Visualization",
  "imageFeature": "https://formidable.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-22-at-1.15.15-PM.png",
  "imageContent":"https://formidable.com/wp-content/uploads/2016/08/Screen-Shot-2016-08-22-at-11.45.11-AM.png" ,
  "teaser": "Before I was a software engineer, I was a music producer. Specifically, I made beats for rap songs. Then file sharing put a dent in the music industry, and it became much harder to do as a career.",
  "content": "Before I was a software engineer, I was a music producer. Specifically, I made beats for rap songs. Then file sharing put a dent in the music industry, and it became much harder to do as a career. But hey, I had programming to fall back on!  I still made music as a hobby over the years, but less and less seriously as time went on. Very recently, I got news that Akai was discontinuing its iconic offering of standalone hardware MPC drum machines. This made me deeply sad. I mowed untold numbers of lawns for my first MPC and it felt to me like the death of an era.",
  "timestamp": "moment.now()" ,
  "author": "formidable.com"

}]

}
